Cinema/src/InformationRegisters/ЖанрыФильмов/ЖанрыФильмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖанрыФильмов</name>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Жанр</name>
    <type>
      <types>CatalogRef.Жанры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/InformationRegisters/СтраныПроизводители/СтраныПроизводители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтраныПроизводители</name>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Страна</name>
    <type>
      <types>CatalogRef.Страны</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/Catalogs/Фильмы/Фильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фильмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Афиша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВФильмотеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НужноСкачать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПросмотреноВКино</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формат3D</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойРелиз</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Cinema/src/CommonModules/ОбщийМодульСервер/Module.bsl
Процедура ПроверкаПовторяющихсяНаименованийПередЗаписью(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ОписанияМетаданных = Источник.Метаданные();
	
	Если ОписанияМетаданных.ДлинаНаименования = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый ("Запрос");
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка
		|ИЗ
		|	Справочник." + ОписанияМетаданных.Имя + "
		|ГДЕ
		|	Наименование = &Наименование
		|	И НЕ ПометкаУдаления";
		
	Запрос.УстановитьПараметр("Наименование", Источник.Наименование);
	
	Если ОписанияМетаданных.Иерархический Тогда
		Запрос.УстановитьПараметр("Родитель", Источник.Родитель);
		ТекстЗапроса = ТекстЗапроса +
			" И Родитель = &Родитель";
	КонецЕсли;
		
	Запрос.Текст = ТекстЗапроса;	
	
	Результат = Запрос.Выполнить();
	
	Отказ = НЕ Результат.Пустой();	

	Если Отказ Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элемент с таким наименованием уже записан в ИБ!";
		Сообщение.Поле = "Наименование";
		Сообщение.УстановитьДанные(Источник);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СинхронизироватьТаблицуФильмов(ТаблицаИменФайлов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Т.Фильм КАК Фильм,
		|	Т.ИмяФайла КАК ИмяФайла,
		|	Т.ПолноеИмя КАК ПолноеИмя,
		|	Т.Размер КАК Размер,
		|	Т.Найден КАК Найден
		|ПОМЕСТИТЬ ВрФильмы
		|ИЗ
		|	&ТаблицаИменФайлов КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВрФильмы.Фильм КАК Фильм,
		|	ВрФильмы.Фильм.РазмерФайла КАК РазмерФайла,
		|	ВрФильмы.Размер КАК Размер
		|ИЗ
		|	ВрФильмы КАК ВрФильмы
		|ГДЕ
		|	ВрФильмы.Найден = ИСТИНА
		|	И (ВрФильмы.Фильм.РазмерФайла <> ВрФильмы.Размер
		|		ИЛИ ВрФильмы.Фильм.ЕстьВФильмотеке = ЛОЖЬ)
		|УПОРЯДОЧИТЬ ПО
		|	Фильм.Наименование";
	Запрос.УстановитьПараметр("ТаблицаИменФайлов", ТаблицаИменФайлов);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		СпрОбъект = Выборка.Фильм.ПолучитьОбъект();
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		
		Если СпрОбъект.РазмерФайла <> Выборка.Размер Тогда
		    СпрОбъект.РазмерФайла = Выборка.Размер;
		КонецЕсли; 
		
		Если НЕ СпрОбъект.ЕстьВФильмотеке Тогда
		    СпрОбъект.ЕстьВФильмотеке = Истина;
		КонецЕсли; 
		
		Если СпрОбъект.Модифицированность() Тогда
			Попытка
			    СпрОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление реквизитов фильма'"), УровеньЖурналаРегистрации.Ошибка, , Выборка.Фильм, ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СохранитьНастройкуВХранилище(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, Настройки);
	
КонецПроцедуры

Функция ЗагрузитьНастройкуИзХранилища(КлючОбъекта, КлючНастроек, ОписаниеНастроек = Неопределено, ИмяПользователя = Неопределено) Экспорт
	
	Настройка = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек, ОписаниеНастроек, ИмяПользователя);
	
	Возврат Настройка;
	
КонецФункции

Процедура КонтрольКорректностиЗаполнения() Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 5
		|	Фильмы.Ссылка КАК Фильм,
		|	МинимальныйРазмерИзображения.Значение КАК МинимальныйРазмерИзображения
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|		ПОЛНОЕ СОЕДИНЕНИЕ Константа.МинимальныйРазмерИзображения КАК МинимальныйРазмерИзображения
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ Фильмы.ЗаполненКорректно
		|	И НЕ Фильмы.ЭтоГруппа
		|	И НЕ Фильмы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильмы.ДатаВыхода,
		|	Фильмы.Наименование";
	
	Запрос = Новый Запрос;
	Схема  = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(ТекстЗапроса);
	
	мТекущаяДата   = ТекущаяДатаСеанса();
	НачальноеЧисло = Час(мТекущаяДата) * 3600 + Минута(мТекущаяДата) * 60 + Секунда(мТекущаяДата);
	ГенСлЧисел     = Новый ГенераторСлучайныхЧисел(НачальноеЧисло);
	КолЗаписей     = ГенСлЧисел.СлучайноеЧисло(1, 30);
	Нечетное       = ?(Окр(КолЗаписей / 2) = КолЗаписей / 2, Ложь, Истина);
	Обновлять      = Ложь;
	
	Для каждого ТекПакетЗапросов Из Схема.ПакетЗапросов Цикл
		
		Для каждого ТекОператор Из ТекПакетЗапросов.Операторы Цикл
			ТекОператор.КоличествоПолучаемыхЗаписей = КолЗаписей;
		КонецЦикла;
		
		Для каждого ТекПорядок Из ТекПакетЗапросов.Порядок Цикл
			Если Нечетное Тогда
		    	ТекПорядок.Направление = НаправлениеПорядкаСхемыЗапроса.ПоВозрастанию;
			Иначе
		    	ТекПорядок.Направление = НаправлениеПорядкаСхемыЗапроса.ПоУбыванию;
			КонецЕсли;
			Нечетное = НЕ Нечетное;
		КонецЦикла;
	
	КонецЦикла;
	
	Запрос.Текст = Схема.ПолучитьТекстЗапроса();
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ФильмКорректноЗаполнен(Запрос, Выборка.Фильм, Выборка.МинимальныйРазмерИзображения) Тогда
			СпрОбъект = Выборка.Фильм.ПолучитьОбъект();
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.ЗаполненКорректно = Истина;
			Попытка
			    СпрОбъект.Записать();
				Обновлять = Истина;
			Исключение
			КонецПопытки;
		Иначе
		КонецЕсли;
		
	КонецЦикла;
	
	Если Обновлять Тогда
		ОбновитьИсториюДанных();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруПараметровЭлПочты() Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресСервераSMTP",	Константы.АдресСервераSMTP.Получить());
	СтруктураПараметров.Вставить("Пароль",				Константы.Пароль.Получить());
	СтруктураПараметров.Вставить("Пользователь",		Константы.Пользователь.Получить());
	СтруктураПараметров.Вставить("ПортSMTP",			Константы.ПортSMTP.Получить());
	СтруктураПараметров.Вставить("АдресОтправителя",	Константы.АдресОтправителя.Получить());
	
	Возврат СтруктураПараметров;

КонецФункции

Процедура ОбновитьИсториюДанных() Экспорт
	
	ИсторияДанных.ОбновитьИсторию();

КонецПроцедуры

Процедура ОбновитьИндекс() Экспорт

	ПолнотекстовыйПоиск.ОбновитьИндекс(Истина, Истина);

КонецПроцедуры

Функция ФильмКорректноЗаполнен(Запрос, Фильм, ОбъемомНеМеньше) Экспорт

	ЗначениеВХранилище = Фильм.Афиша.Получить();
	Если ТипЗнч(ЗначениеВХранилище) <> Тип("Картинка") Тогда
		Возврат Ложь;
	Иначе
		Если ЗначениеВХранилище.Вид = ВидКартинки.Пустая Тогда
			Возврат Ложь;
		КонецЕсли;
		ДвчДанные = ЗначениеВХранилище.ПолучитьДвоичныеДанные();
		Если ТипЗнч(ДвчДанные) = Тип("ДвоичныеДанные") Тогда
			РазмерДанных = ДвчДанные.Размер();
			Если ОбъемомНеМеньше > РазмерДанных Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Фильм", Фильм);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Фильм
		|ПОМЕСТИТЬ Фильмы
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	Фильмы.Ссылка = &Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Аннотации.Владелец КАК Фильм,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Аннотации.Ссылка) КАК Аннотация
		|ПОМЕСТИТЬ Аннотации
		|ИЗ
		|	Справочник.Аннотации КАК Аннотации
		|ГДЕ
		|	Аннотации.Владелец = &Фильм
		|	И НЕ Аннотации.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Аннотации.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖанрыФильмов.Фильм КАК Фильм,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЖанрыФильмов.Жанр) КАК Жанр
		|ПОМЕСТИТЬ Жанры
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|ГДЕ
		|	ЖанрыФильмов.Фильм = &Фильм
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖанрыФильмов.Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныПроизводители.Фильм КАК Фильм,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтраныПроизводители.Страна) КАК Страна
		|ПОМЕСТИТЬ Страны
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|ГДЕ
		|	СтраныПроизводители.Фильм = &Фильм
		|
		|СГРУППИРОВАТЬ ПО
		|	СтраныПроизводители.Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Фильм КАК Фильм
		|ИЗ
		|	Фильмы КАК Фильмы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Аннотации КАК Аннотации
		|		ПО Фильмы.Фильм = Аннотации.Фильм
		|		ЛЕВОЕ СОЕДИНЕНИЕ Жанры КАК Жанры
		|		ПО Фильмы.Фильм = Жанры.Фильм
		|		ЛЕВОЕ СОЕДИНЕНИЕ Страны КАК Страны
		|		ПО Фильмы.Фильм = Страны.Фильм
		|ГДЕ
		|	ВЫБОР
		|			КОГДА Аннотации.Аннотация ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			КОГДА Жанры.Жанр ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			КОГДА Страны.Страна ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура Пауза(Секунд) Экспорт
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ОбщийМодульСервер.Пауза", Параметры);
	КонецЕсли;
		
	Попытка
		ФоновоеЗадание.ОжидатьЗавершения(Секунд);
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Процедура УменьшениеРазмеровИзображений() Экспорт
	
	Перем КодВозврата;
	
	УтилитаСжатияИзображений = Константы.УтилитаСжатияИзображений.Получить(); //"C:\Program Files\XnView\nconvert.exe";
	Если ПустаяСтрока(УтилитаСжатияИзображений) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыУтилитыСжатия = Константы.ПараметрыУтилитыСжатия.Получить(); //"-resize 90% 90% -overwrite -no_auto_ext";
	ФайлУтилитаСжатия      = Новый Файл(УтилитаСжатияИзображений);
	
	Если НЕ ФайлУтилитаСжатия.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
		|	ЕСТЬNULL(Фильмы.Ссылка, ЗНАЧЕНИЕ(Справочник.Фильмы.ПустаяСсылка)) КАК Фильм,
		|	ЕСТЬNULL(Фильмы.РазмерИзображения, 0) КАК СтарыйРазмер
		|ИЗ
		|	Константы КАК Константы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Фильмы КАК Фильмы
		|		ПО (Фильмы.РазмерИзображения > Константы.МаксимальныйРазмерИзображения)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтарыйРазмер УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Фильм) ИЛИ Выборка.СтарыйРазмер = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Афиша = Выборка.Фильм.Афиша.Получить();
		
		Если ТипЗнч(Афиша) <> Тип("Картинка") Тогда
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Уменьшение размеров изображений'"), УровеньЖурналаРегистрации.Ошибка, ,
										Выборка.Фильм, НСтр("ru = 'Реквизит ""Афиша"" не является типом ""Картинка"".'"));
			Продолжить;
		КонецЕсли;
		
		РасширениеФайла = "." + НРег(Строка(Афиша.Формат()));
		БинарныеДанные  = Афиша.ПолучитьДвоичныеДанные();
		ИмяВременного   = ПолучитьИмяВременногоФайла(РасширениеФайла);
		
		Попытка
			БинарныеДанные.Записать(ИмяВременного);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Уменьшение размеров изображений'"), УровеньЖурналаРегистрации.Ошибка, ,
										Выборка.Фильм, СтрШаблон(НСтр("ru = 'Ошибка сохранения файла %1; по причине: %2'"), ИмяВременного, ОписаниеОшибки()));
			Возврат;
		КонецПопытки;
		
		СтрокаКоманды = СтрШаблон("%1 %2 %3", УтилитаСжатияИзображений, ПараметрыУтилитыСжатия, ИмяВременного);
		ЗапуститьПриложение(СтрокаКоманды, , Истина, КодВозврата);
		
		НоваяКартинка     = Новый Картинка(ИмяВременного);
		БинарныеДанные    = НоваяКартинка.ПолучитьДвоичныеДанные();
		РазмерИзображения = БинарныеДанные.Размер();
		
		Если Выборка.СтарыйРазмер > РазмерИзображения Тогда
			
			СпрОбъект = Выборка.Фильм.ПолучитьОбъект();
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.Афиша = Новый ХранилищеЗначения(НоваяКартинка);
			СпрОбъект.РазмерИзображения = БинарныеДанные.Размер();
			СпрОбъект.ВысотаИзображения = НоваяКартинка.Высота();
			СпрОбъект.ШиринаИзображения = НоваяКартинка.Ширина();
		
			Попытка
				СпрОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Уменьшение размеров изображений'"), УровеньЖурналаРегистрации.Ошибка, ,
											Выборка.Фильм, СтрШаблон(НСтр("ru = 'Ошибка записи фильма %1; по причине: %2'"), Выборка.Фильм, ОписаниеОшибки()));
				Возврат;
			КонецПопытки;
			
		КонецЕсли;
		
		УдалитьФайлы(ИмяВременного);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ПогодаВВолхове() Экспорт

	ТекстСообщения = Обработки.ПогодаВВолхове.ПолучитьИОтправитьПогодуНаСервере();
	ЗаписьЖурналаРегистрации("ПогодаВВолхове", , , , ТекстСообщения);

КонецПроцедуры

Процедура УдалитьФайлыНаСервере(ТекПуть, Маска) Экспорт

	//УдалитьФайлы(ТекПуть, Маска);

КонецПроцедуры

Функция ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, ИмяРеквизита) Экспорт

	Возврат СсылкаНаОбъект[ИмяРеквизита];

КонецФункции

Процедура ОбновлениеИндексаПолнотекстовогоПоиска() Экспорт

	Если ПолнотекстовыйПоиск.ИндексАктуален() Тогда
		Возврат;
	КонецЕсли;

	ПолнотекстовыйПоиск.ОбновитьИндекс(Истина, Истина);
	
КонецПроцедуры
